Revit 2024 API
SharedParameterElement.ShouldHideWhenNoValue Method
 Indicates whether the parameter should be hidden from the properties palette if it has no value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool ShouldHideWhenNoValue()
Visual Basic
Public Function ShouldHideWhenNoValue As Boolean
Visual C++
public:
bool ShouldHideWhenNoValue()
See Also
SharedParameterElement Class
Autodesk.Revit.DB Namespace